# NumberSystemTextSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..NumberSystemTextSize Property
ParameterTypeId Class See Also
---
"Number Size"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId NumberSystemTextSize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NumberSystemTextSize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ NumberSystemTextSize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace